app/Controllers/BoardController.php

    public function addLook($boardId = null)
    {
        $pinModel = new \App\Models\PinModel();
        $data = $this->request->getJSON(true);
        $data['board_id'] = $boardId; // Hubungkan pin dengan ID board-nya

        // Karena tags dan products itu bentuknya array di JSON,
        // kita ubah jadi string agar bisa masuk ke database SQLite
        if(isset($data['tags'])) $data['tags'] = json_encode($data['tags']);
        if(isset($data['products'])) $data['products'] = json_encode($data['products']);

        if ($pinModel->insert($data)) {
---
INSERT INTO `pins` (`title`, `category`, `tags`, `board_id`) VALUES ('Monochrome fit', 'tops', '["monochrome","minimalist"]', '1')

    public function show($id = null)
    {
        $board = $this->model->find($id);
        if (!$board) return $this->failNotFound('Board tidak ketemu');

        $pinModel = new \App\Models\PinModel();
        $board['pins'] = $pinModel->where('board_id', $id)->findAll();
---
SELECT *
FROM `pins`
WHERE `board_id` = '1'

    public function searchLooks()
    {
        $pinModel = new \App\Models\PinModel();
        $tag = $this->request->getVar('tags');
        $category = $this->request->getVar('category');

        $builder = $pinModel->builder();

        if ($tag) {
            $builder->like('tags', $tag);
        }
        if ($category) {
            $builder->where('category', $category);
        }

        $data = $builder->get()->getResult();
---
SELECT *
FROM `pins`
WHERE `tags` LIKE '%minimalist%' ESCAPE '!'
AND `category` = 'tops'